# ------------------------------------------------------------------ #
#                                                                    #
# -------工作日模式要努力到什么水平，才能与每天努力1%一样？------------- #
#                                                                    #
# -------- A君：一年356天，每天进步1%,不停歇 ----------------------- - #
#                                                                   #
# ------- B君：一年365天，每周5天休息2日，休息日下降1%，要多努力呢？---- #
#                                                                   #
# ---------------------- def... while... -------------------------- #



''' =============================================================='''

def dayUP (df):                             # def 保留字用于定义函数
    dayup = 1                               # -------------------------------- #
    for i in range (365):                   # -- 根据df参数计算工作日力量的函数 --#
                                            # -- 参数不同，这代码可共用 ---------#
        if i % 7 in [6,0]:                  # ---------------------------------#
            dayup = dayup * (1 - 0.01)
        else:
            dayup = dayup * (1 + df)
    return dayup 
dayfactor = 0.01

while dayUP (dayfactor) < 37.78:           # while 保留字判断条件是否成立
    dayfactor += 0.001                     # 条件成立时循环执行

print ()

print ("工作日的努力参数是：{:.2f}" .format (dayfactor))

print ()
