# 字符串类型格式 

print()

q = "{} 笔记本Pro运行的 {} 内存占用为 {} ".format('“小米”',' “VS code”','400')   # 默认顺序 0 1 2 
print (q)

print ()

q1 = "{1} 笔记本Pro运行的 {0} 内存占用为 {2} ".format('“小米”','“VS code”',400)  # 1 0 2 顺序 
print (q1)
print ()

##########################################################################
#  -------------------- format()方法的格式控制 --------------------------##
#                                                                       ##
# ============   ： <填充>  <对齐>  <宽度>      ============================##
#                                                                          ##
# === : 《用于填充的单个字符》;《< 左对齐 ,> 右对齐,^ 居中对齐》; 《槽设定的输出宽度》=== ##
#                                                                         ##
##########################################################################


a = " {0:=^20} " .format ( "PYTHON" )
print ( a )

a1 = " {0:*>20} " .format ( " BAT " )
print ( a1 )

a2 = " {0:10} " .format ( "ABC" )
print ( a2 )

b = "{0:,.2f}".format ( 12345.6789 )
print ( b )

b1 = " {0:b} , {0:c} , {0:d} , {0:e} ".format ( 456 )
print ( b1 )

b3 = " {0:e} , {0:E} , {0:f} , {0:%} ".format ( 2.34 )
print ( b3 )

print ()



