#=======================================================#
# ***************************************************** #
# **************** 字符串处理函数（部分）*************** #
# *********** 以函数形式提供的字符串处理功能 ************ #
#                                                      #
#======================================================#


print (len('asdfg')) # 返回字符串的长度

print (str ([1.2])) # 返回字符串

print (hex (555)) # 返回十六进制

print (oct(355)) # 八进制

print (chr (1004)) # 返回Unicode编码对应的字符

print ('u编码：{}'.format (ord('卐')) ) # 返回其对应的Uniclde编码

print ()


# ------------------- Uniclde 编码 -------------------#

a = '1+1=2 '
b = chr(1004)
print (a+b)


print ()

c = "这个字符♉ 的Unicode 值是 " + str (ord('♉'))
print (c)

print ()

for i in range (12):
    print (chr(9800 + i ),end = "" )

