# ====================================================#

# -------------- 1、单分支结构 -------------- 
# --------- 根据判断条件结果而选择不同向前路径的运行方式 --------- 

# --- if <条件>： --- 
# ---    <语句块> --- 

print('单分支：...99')

guess = eval(input('输入：'))
if guess == 99:
    print ("猜对了。")

print()

# -------------- 2、二分支结构 -------------- 
# --- if 《》：--- 
# ---   语句块 --- 
# --- else: --- 
# ---   语句块 --- 

print ('二分支结构示例：...0--99--')

gu = eval(input('2输入：'))
if gu == 99:
    print('猜对了。')
else:
    print ('猜错了。')

print()

# --------------  二分支；紧凑形式：适用于简单表达式的二分支结构。 -------------- 
#  --- <表达式> if <条件> else <表达式2>  --- 

print ("紧凑形式：...0--99--")

gu = eval(input('2.5输入：'))
print ('猜{}了'.format("dui" if gu==99 else 'cuo'))

print()

#  -------------- 3、多分支结构：对不过分数分级的问题。 --------------  
#  -----------  注意多条件之间的包含关系。 --------------  
#  -----------  注意变量取值范围的覆盖。 --------------  

#  --- if <>: --- 
#  ---   ... --- 
#  --- elif <>: --- 
#  ---   ... --- 
#  --- ....... --- 
#  --- else: --- 
#    --- ... --- 

print("多分支：...>= 60,70,80,90...")

sc = eval(input("3.0输入："))
if sc >= 90:
    gr = "D"
elif sc >= 80:
    gr = "C"
elif sc >= 70:
    gr = "B"
elif sc >= 60:
    gr = "A"
print ("输入成绩属于级别 {} ！" .format( gr ))     # 成绩级别不准啊。


# ====================================================#
