 
# ----------------------------文件的使用---------------------------- #

#-----------------------文件打开------------------------#

###############################################

'''
打开模式:
f = open("f.txt")   - 文本形式、只读模式、默认值
f = open("f.txt", "rt")  - 文本形式、只读模式、同默认值
f = open("f.txt", "w")   - 文本形式、覆盖写模式
f = open("f.txt", "a+")   - 文本形式、追加写模式+ 读文件
f = open("f.txt", "x")    - 文本形式、创建写模式
f = open("f.txt", "b")   - 二进制形式、只读模式
f = open("f.txt", "wb")   - 二进制形式、覆盖写模式
'''

################################################

bf = open( "D:\文档\Python文件\哈姆雷特-英文-片段.txt", "rt" )
print(bf.readline())
bf.close()


print(bf)

a = bf
print(a)


b1 = open("../第6周/哈姆雷特-英文-片段.txt", 'rb')
print(b1.readline())
b1.close()

print()
a1 = "="
a2 = a1*50
print(a2)
print()


#-----------------------文件内容的读取-----------------------#

f = open("../第6周/哈姆雷特-英文-片段.txt", 'r')

b =  f.read( 20 )   # 读取全部内容，如果给出参数，则读取参数长度内容。

print( "文件内容读取（哈姆雷特-英文-片段）：", b )

b1 = f.readline()   # 读入一行内容，如果给出参数，则读入该行前参数长度。
print(b1)
不 = f.readline(3)
print(不)

b2 = f.readlines()  # 读入所有行，以每行为元素形成列表，如给出参数，则读入前参数行。
print(b2)

b3 = f.readlines(5)
print(b3)





