
# ----------------------- os库的使用 ----------------------- #


# ------------- 进程管理 -------------
# ----- - 执行程序或命令command --
# ----- - 在Windows系统中，返回值为cmd的调用返回信息 --

import os
os.system("C:\\Windows\\System32\\calc.exe")    #执行程序：打开计算机。

os.system("C:\\Windows\\System32\\mspaint.exe D:\\图片\\WordCloud\\grwordcloud.png" )     #执行画图程序,打开指定文件。



#******************************************************#
''' #-------------------------------------------------

--- os.system("C:\\Windows\\System32\\mspaint.exe \
---    D:\\图片\\WordCloud\\grwordcloud.png" ) 

···在这里此种（ \ 反斜杠后换行）写法会出错。

''' #------------------------------------------------
#*****************************************************#


