
# --*-- Pandas库:数据的相关分析 --*-- #


#****************************************************************
'''
    ---两个事物，表示为X和Y，如何判断它们之间的存在相关性？
    
        相关性: 
            • X增大，Y增大，两个变量正相关
            • X增大，Y减小，两个变量负相关
            • X增大，Y无视，两个变量不相关
            
        协方差： 
            两个事物，表示为X和Y，如何判断它们之间的存在相关性？
            
            • 协方差>0, X和Y正相关
            • 协方差<0, X和Y负相关
            • 协方差=0, X和Y独立无关

-------------------------------------------------------------------

    Pearson相关系数
    
        两个事物，表示为X和Y，如何判断它们之间的存在相关性？
        
        • 0.8‐1.0 极强相关
        • 0.6‐0.8 强相关
        • 0.4‐0.6 中等程度相关
        • 0.2‐0.4 弱相关
        • 0.0‐0.2 极弱相关或无相关
        
    r取值范围[‐1,1]
    
---------------------------------------------------------
    相关分析函数：
    
    .cov() ： 计算协方差矩阵
    .corr()： 计算相关系数矩阵, Pearson、Spearman、Kendall等系数
    
'''
#****************************************************************


# 实列： 房价增幅与M2增幅的相关性

import pandas as pd

hprice = pd.Series( [3.04, 22.93, 12.75, 22.6, 12.33], index = ['2008', '2009', '2010', '2011', '2012'] )

m2 = pd.Series( [ 8.18, 18.38, 9.13, 7.82, 6.69], index = ['2008', '2009', '2010', '2011', '2012'] )

m = hprice.corr(m2)

print ( m )

